{
 "cells": [
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "(AND (JOIN (R P361) Q35) (JOIN P31 Q2221906))\n",
      "\n",
      "(OR (AND (JOIN (R P17) Q12060361) (JOIN P31 Q1048835)) (AND (JOIN (R P27) Q5394403) (JOIN P31 Q1048835)))\n",
      "\n",
      "(COUNT (AND (JOIN (R P17) Q172771) (JOIN P31 Q15617994)))\n",
      "\n",
      "(DIFF (AND (JOIN P710 Q526275) (JOIN P31 Q1203472)) (JOIN P710 Q1736517))\n",
      "\n",
      "(IS_TRUE (Q230 P530 Q35) (Q230 P530 Q40) (Q230 P530 Q664))\n",
      "\n",
      "(COUNT (DISTINCT (OR (AND (JOIN (R P136) Q26208739) (JOIN P31 Q151885)) (AND (JOIN (R P136) Q5323744) (JOIN P31 Q151885)))))\n",
      "\n",
      "(DISTINCT (AND (JOIN P355 (VALUES Q7163209 Q5908783 Q1273145)) (JOIN P31 Q43229)))\n",
      "\n",
      "(GT (GROUP_COUNT (AND (JOIN (R P495) (JOIN P31 Q2031291)) (JOIN P31 Q15617994))) (AND (JOIN (R P495) Q717) (JOIN P31 Q15617994)))\n",
      "\n",
      "(COUNT (GT (GROUP_COUNT (AND (JOIN P530 (JOIN P31 Q15617994)) (JOIN P31 Q15617994))) 0))\n",
      "\n",
      "(ARGMAX (GROUP_COUNT (AND (JOIN P1441 (JOIN P31 Q2342494)) (JOIN P31 Q3895768))))\n",
      "\n",
      "(COUNT (GT (GROUP_SUM (GROUP_COUNT (AND (JOIN P1441 (JOIN P31 Q15416)) (JOIN P31 Q502895))) (GROUP_COUNT (AND (JOIN P1441 (JOIN P31 Q838948)) (JOIN P31 Q502895)))) 0))\n",
      "\n",
      "(ARGMIN (GROUP_SUM (GROUP_COUNT (AND (JOIN (R P1923) (JOIN P31 Q13406554)) (JOIN P31 Q1194951))) (GROUP_COUNT (AND (JOIN (R P1923) (JOIN P31 Q15275719)) (JOIN P31 Q1194951)))))\n",
      "\n"
     ]
    }
   ],
   "source": [
    "import re\n",
    "\n",
    "class ParseError(Exception):\n",
    "    pass\n",
    "\n",
    "class Parser:\n",
    "    def __init__(self):\n",
    "        pass\n",
    "    \n",
    "    def parse_query(self, query):\n",
    "        if query.startswith('ASK'):\n",
    "            body = query[3:]\n",
    "            body_lines = body.strip('} {').split('.')[:-1]\n",
    "            triplets = ['(' + ' '.join([self.remove_prefix(elem) for elem in body_line.strip().split(' ')]) + ')' for body_line in body_lines]\n",
    "            return '(IS_TRUE {})'.format(' '.join(triplets))\n",
    "\n",
    "        if query.startswith('SELECT'):\n",
    "            query = query[6:]\n",
    "        else:\n",
    "            raise ParseError()\n",
    "        query = query.lstrip()\n",
    "\n",
    "        ret_var = '?x'\n",
    "        decorators = []\n",
    "        if query.startswith('?x'):\n",
    "            query = query[2:]\n",
    "        elif query.startswith('?y'):\n",
    "            query = query[2:]\n",
    "            ret_var = '?y'\n",
    "        elif query.startswith('DISTINCT ?x'):\n",
    "            query = query[11:]\n",
    "            decorators.append('DISTINCT')\n",
    "        elif query.startswith('(COUNT(*) AS ?count)'):\n",
    "            query = query[20:]\n",
    "            decorators.append('COUNT')\n",
    "        elif query.startswith('(COUNT(*) AS ?result)'):\n",
    "            query = query[22:]\n",
    "            decorators.append('COUNT')\n",
    "        elif query.startswith('(COUNT(DISTINCT ?x) AS ?count)'):\n",
    "            query = query[30:]\n",
    "            decorators.append('COUNT')\n",
    "            decorators.append('DISTINCT')\n",
    "        query = query.lstrip()\n",
    "\n",
    "        if query.startswith('WITH'):\n",
    "            subqueries = []\n",
    "            while query.startswith('WITH'):\n",
    "                begin = 6\n",
    "                stack = 1\n",
    "                i = begin\n",
    "                while i < len(query):\n",
    "                    if query[i] == '{':\n",
    "                        stack += 1\n",
    "                    elif query[i] == '}':\n",
    "                        stack -= 1\n",
    "                        if stack == 0:\n",
    "                            end = i\n",
    "                            break\n",
    "                    i += 1\n",
    "                subquery = query[begin:end].lstrip()\n",
    "                query = query[end + 1:].lstrip()[2:].lstrip().split(' ', 1)[1].lstrip()\n",
    "                subqueries.append(subquery)\n",
    "            s_expr = self.parse_subqueries(subqueries, query)\n",
    "        elif query.startswith('WHERE'):\n",
    "            body = query[6:]\n",
    "            if 'UNION' not in body:\n",
    "                s_expr = self.parse_naive_body(body, ret_var)\n",
    "            else:\n",
    "                s_expr = '(OR ' + ' '.join([(self.parse_naive_body(body, ret_var)) for body in body.split(' UNION ')]) + ')'\n",
    "        else:\n",
    "            raise ParseError()\n",
    "\n",
    "        for decorator in decorators[::-1]:\n",
    "            s_expr = '({} {})'.format(decorator, s_expr)\n",
    "        \n",
    "        return s_expr\n",
    "        \n",
    "    def parse_subqueries(self, subqueries, filter):\n",
    "        tupcountfin = self.parse_subquery(subqueries[0])\n",
    "        if len(subqueries) > 4:\n",
    "            tupcounts2 = self.parse_subquery(subqueries[2])\n",
    "            tupcountfin = '(GROUP_SUM {} {})'.format(tupcountfin, tupcounts2)\n",
    "\n",
    "        if len(subqueries) == 4 or len(subqueries) == 6:\n",
    "            if 'MIN' in subqueries[-1]:\n",
    "                return '(ARGMIN {})'.format(tupcountfin)\n",
    "            elif 'MAX' in subqueries[-1]:\n",
    "                return '(ARGMAX {})'.format(tupcountfin)\n",
    "            else:\n",
    "                raise ParseError()\n",
    "        \n",
    "        operator_to_function = {'<': 'LT', '<=': 'LE', '=': 'EQ', '>=': 'GE', '>': 'GT'}\n",
    "        pattern = r'FILTER \\((.*?) (.*?) (.*?)\\)'\n",
    "        re_match = re.search(pattern, filter)\n",
    "        if re_match:\n",
    "            operator = re_match.group(2)\n",
    "            if len(subqueries) == 3 or len(subqueries) == 5:\n",
    "                num = re_match.group(3)\n",
    "            elif len(subqueries) == 2:\n",
    "                num_body = re.search(r'SELECT \\(COUNT\\(\\*\\) AS \\?count\\) WHERE {(.*?)}', filter).group(1)\n",
    "                num = self.parse_naive_body(num_body, '?w')\n",
    "            else:\n",
    "                raise ParseError()\n",
    "            return '({} {} {})'.format(operator_to_function[operator], tupcountfin, num)\n",
    "        else:\n",
    "            return tupcountfin\n",
    "    \n",
    "    def parse_subquery(self, subquery):\n",
    "        self.parse_assert(subquery.startswith('SELECT'))\n",
    "        subquery = subquery[6:]\n",
    "        subquery = subquery.lstrip()\n",
    "        \n",
    "        if subquery.startswith('?x'):\n",
    "            subquery = subquery[2:]\n",
    "            ret_var = '?x'\n",
    "        elif subquery.startswith('?y'):\n",
    "            subquery = subquery[2:]\n",
    "            ret_var = '?y'\n",
    "        else:\n",
    "            raise ParseError()\n",
    "        subquery = subquery.lstrip()\n",
    "\n",
    "        self.parse_assert(subquery.startswith('(COUNT(*) AS ?tupcount)'))\n",
    "        subquery = subquery[23:]\n",
    "        subquery = subquery.lstrip()\n",
    "        \n",
    "        self.parse_assert(subquery.startswith('WHERE'))\n",
    "        body = subquery[6:]\n",
    "        s_expr = '(GROUP_COUNT {})'.format(self.parse_naive_body(body, ret_var))\n",
    "        return s_expr\n",
    "    \n",
    "    def remove_prefix(self, elem):\n",
    "        if elem.startswith('wd:'):\n",
    "            return elem[3:]\n",
    "        elif elem.startswith('wdt:'):\n",
    "            return elem[4:]\n",
    "        else:\n",
    "            return elem\n",
    "\n",
    "    def parse_naive_body(self, body, ret_var):\n",
    "        body_lines = body.strip('} {').split('.')[:-1]\n",
    "\n",
    "        def split_body_line(body_line):\n",
    "            body_line = body_line.strip()\n",
    "            if body_line.startswith('VALUES ?y'):\n",
    "                values = ' '.join([self.remove_prefix(value) for value in body_line[12:-2].split(' ')])\n",
    "                triplet = ['?y', 'VALUES', values]\n",
    "            else:\n",
    "                triplet = [self.remove_prefix(elem) for elem in body_line.split(' ')]\n",
    "            return triplet\n",
    "        \n",
    "        diff = None\n",
    "        if body_lines[-1].lstrip().startswith('FILTER NOT EXISTS'):\n",
    "            triplet = split_body_line(re.search(r'FILTER NOT EXISTS {(.*)', body_lines.pop()).group(1))\n",
    "            diff = self.triplet_to_clause('?x', triplet, {})\n",
    "            \n",
    "        triplets = [split_body_line(body_line) for body_line in body_lines]\n",
    "        \n",
    "        triplets_pool = triplets\n",
    "        var_dep_list = []\n",
    "        successors = []\n",
    "        dep_triplets, triplets_pool = self.resolve_dependancy(triplets_pool, ret_var, successors)\n",
    "        var_dep_list.append((ret_var, dep_triplets))   \n",
    "\n",
    "        while len(successors):\n",
    "            tgt_var = successors[0]\n",
    "            successors = successors[1:]\n",
    "            dep_triplets, triplets_pool = self.resolve_dependancy(triplets_pool, tgt_var, successors)\n",
    "            self.parse_assert(len(dep_triplets) > 0)\n",
    "            var_dep_list.append((tgt_var, dep_triplets))\n",
    "        \n",
    "        self.parse_assert(len(triplets_pool) == 0)\n",
    "\n",
    "        s_expr = self.dep_graph_to_s_expr(var_dep_list, ret_var)\n",
    "        if diff:\n",
    "            s_expr = '(DIFF {} {})'.format(s_expr, diff)\n",
    "\n",
    "        return s_expr\n",
    "    \n",
    "    def resolve_dependancy(self, triplets, target_var, successors):\n",
    "        dep = []\n",
    "        left = []\n",
    "        for tri in triplets:\n",
    "            if tri[0] == target_var:\n",
    "                dep.append(tri)\n",
    "                if tri[-1].startswith('?') and tri[-1] not in successors:\n",
    "                    successors.append(tri[-1])\n",
    "            elif tri[-1] == target_var:\n",
    "                dep.append(tri)\n",
    "                if tri[0].startswith('?') and tri[0] not in successors:\n",
    "                    successors.append(tri[0])\n",
    "            else:\n",
    "                left.append(tri)\n",
    "        return dep, left\n",
    "    \n",
    "    def dep_graph_to_s_expr(self, var_dep_list, ret_var):\n",
    "        self.parse_assert(var_dep_list[0][0] == ret_var)\n",
    "        var_dep_list.reverse()\n",
    "        parsed_dict = {}\n",
    "\n",
    "        for var_name, dep_relations in var_dep_list:\n",
    "            clause = self.triplet_to_clause(var_name, dep_relations[0], parsed_dict)\n",
    "            for tri in dep_relations[1:]:\n",
    "                n_clause = self.triplet_to_clause(var_name, tri, parsed_dict)\n",
    "                clause = '(AND {} {})'.format(clause, n_clause)\n",
    "            parsed_dict[var_name] = clause\n",
    "        return parsed_dict[ret_var]\n",
    "    \n",
    "    def triplet_to_clause(self, tgt_var, triplet, parsed_dict):\n",
    "        if triplet[1] == 'VALUES':\n",
    "            return '(VALUES {})'.format(triplet[-1])\n",
    "        if triplet[0] == tgt_var:\n",
    "            other = triplet[-1]\n",
    "            if other in parsed_dict:\n",
    "                other = parsed_dict[other]\n",
    "            return '(JOIN {} {})'.format(triplet[1], other)\n",
    "        elif triplet[-1] == tgt_var:\n",
    "            other = triplet[0]\n",
    "            if other in parsed_dict:\n",
    "                other = parsed_dict[other]\n",
    "            return '(JOIN (R {}) {})'.format(triplet[1], other)\n",
    "        else:\n",
    "            raise ParseError()\n",
    "    \n",
    "    def parse_assert(self, eval):\n",
    "        if not eval:\n",
    "            raise ParseError()\n",
    "\n",
    "parser = Parser()\n",
    "\n",
    "queries = [\n",
    "    'SELECT ?x WHERE { wd:Q35 wdt:P361 ?x . ?x wdt:P31 wd:Q2221906 .  }',\n",
    "    'SELECT ?x WHERE { { wd:Q12060361 wdt:P17 ?x . ?x wdt:P31 wd:Q1048835 .  } UNION { wd:Q5394403 wdt:P27 ?x . ?x wdt:P31 wd:Q1048835 .  } }',\n",
    "    'SELECT (COUNT(*) AS ?count) WHERE { wd:Q172771 wdt:P17 ?x . ?x wdt:P31 wd:Q15617994 .  }',\n",
    "    'SELECT ?x WHERE { ?x wdt:P710 wd:Q526275 . ?x wdt:P31 wd:Q1203472 .  FILTER NOT EXISTS { ?x wdt:P710 wd:Q1736517 .  } }',\n",
    "    'ASK { wd:Q230 wdt:P530 wd:Q35 .  wd:Q230 wdt:P530 wd:Q40 .  wd:Q230 wdt:P530 wd:Q664 .  }',\n",
    "    'SELECT (COUNT(DISTINCT ?x) AS ?count) WHERE { { wd:Q26208739 wdt:P136 ?x . ?x wdt:P31 wd:Q151885 .  } UNION { wd:Q5323744 wdt:P136 ?x . ?x wdt:P31 wd:Q151885 .  } }',\n",
    "    'SELECT DISTINCT ?x WHERE { ?x wdt:P355 ?y . VALUES ?y { wd:Q7163209 wd:Q5908783 wd:Q1273145 }. ?x wdt:P31 wd:Q43229 .  }',\n",
    "    'SELECT ?y  WITH { SELECT ?y (COUNT(*) AS ?tupcount) WHERE { ?x wdt:P495 ?y . ?x wdt:P31 wd:Q2031291 . ?y wdt:P31 wd:Q15617994 .  } GROUP BY ?y } AS  %tupcounts WITH {  SELECT DISTINCT ?y (0 AS ?tupcount) WHERE {  { { ?b wdt:P495 ?y . ?y wdt:P31 wd:Q15617994 .  } }  FILTER NOT EXISTS { ?x wdt:P495 ?y . ?x wdt:P31 wd:Q2031291 . ?y wdt:P31 wd:Q15617994 .  } }  } AS %zerotupcounts  WHERE { { SELECT ?y ?tupcount WHERE { INCLUDE %tupcounts } }  UNION { SELECT ?y ?tupcount WHERE { INCLUDE %zerotupcounts } }  FILTER (?tupcount > ?count){SELECT (COUNT(*) AS ?count) WHERE {wd:Q717 wdt:P495 ?w . ?w wdt:P31 wd:Q15617994 . }} }',\n",
    "    'SELECT (COUNT(*) AS ?result) WITH { SELECT  ?x (COUNT(*) AS ?tupcount) WHERE { ?x wdt:P530 ?y . ?x wdt:P31 wd:Q15617994 . ?y wdt:P31 wd:Q15617994 .  } GROUP BY ?x }  AS %tupcounts  WITH { SELECT DISTINCT ?x (0 AS ?tupcount) WHERE { { { ?x wdt:P530 ?b . ?x wdt:P31 wd:Q15617994 .  } } FILTER NOT EXISTS { ?x wdt:P530 ?y . ?x wdt:P31 wd:Q15617994 . ?y wdt:P31 wd:Q15617994 .  } } } AS %zerotupcounts  WITH { SELECT ?x ?tupcount WHERE { { SELECT ?x ?tupcount WHERE { INCLUDE %tupcounts } } UNION { SELECT ?x ?tupcount WHERE { INCLUDE %zerotupcounts } } } } AS %TuplesCounts  WHERE  { INCLUDE %TuplesCounts . FILTER (?tupcount > 0) }',\n",
    "    'SELECT  ?x  WITH { SELECT  ?x (COUNT(*) AS ?tupcount) WHERE { ?x wdt:P1441 ?y . ?x wdt:P31 wd:Q3895768 . ?y wdt:P31 wd:Q2342494 .  } GROUP BY ?x }  AS %tupcounts  WITH { SELECT DISTINCT ?x (0 AS ?tupcount) WHERE { { { ?x wdt:P1441 ?b . ?x wdt:P31 wd:Q3895768 .  } } FILTER NOT EXISTS { ?x wdt:P1441 ?y . ?x wdt:P31 wd:Q3895768 . ?y wdt:P31 wd:Q2342494 .  } } } AS %zerotupcounts  WITH { SELECT ?x ?tupcount WHERE { { SELECT ?x ?tupcount WHERE { INCLUDE %tupcounts } } UNION { SELECT ?x ?tupcount WHERE { INCLUDE %zerotupcounts } } } } AS %TuplesCounts  WITH { SELECT (MAX(?tupcount) AS ?count) WHERE { INCLUDE %TuplesCounts } } AS %maxMinCount  WHERE { INCLUDE %TuplesCounts . INCLUDE %maxMinCount .  FILTER (?tupcount = ?count) } ',\n",
    "    'SELECT (COUNT(*) AS ?result) WITH { SELECT ?x (COUNT(*) AS ?tupcount) WHERE { ?x wdt:P1441 ?y . ?x wdt:P31 wd:Q502895 . ?y wdt:P31 wd:Q15416 .  } GROUP BY ?x }  AS %tupcounts1  WITH { SELECT DISTINCT ?x (0 AS ?tupcount) WHERE { { { ?x wdt:P1441 ?b . ?x wdt:P31 wd:Q502895 .  } } FILTER NOT EXISTS { ?x wdt:P1441 ?y . ?x wdt:P31 wd:Q502895 . ?y wdt:P31 wd:Q15416 .  } } } AS %zerotupcounts1  WITH { SELECT ?x (COUNT(*) AS ?tupcount) WHERE { ?x wdt:P1441 ?y . ?x wdt:P31 wd:Q502895 . ?y wdt:P31 wd:Q838948 .  } GROUP BY ?x }  AS %tupcounts2 WITH { SELECT DISTINCT ?x (0 AS ?tupcount) WHERE { { { ?x wdt:P1441 ?b . ?x wdt:P31 wd:Q502895 .  } }  FILTER NOT EXISTS { ?x wdt:P1441 ?y . ?x wdt:P31 wd:Q502895 . ?y wdt:P31 wd:Q838948 .  } } } AS %zerotupcounts2 WITH {SELECT ?x (SUM(?tupcount) AS ?tupcountfin) WHERE { { SELECT ?x ?tupcount WHERE { INCLUDE %tupcounts1 } } UNION { SELECT ?x ?tupcount WHERE { INCLUDE %zerotupcounts1 } } UNION { SELECT ?x ?tupcount WHERE { INCLUDE %tupcounts2 } } UNION { SELECT ?x ?tupcount WHERE { INCLUDE %zerotupcounts2 } } } GROUP BY ?x } AS %TuplesCounts  WHERE {INCLUDE %TuplesCounts. FILTER (?tupcountfin > 0) }',\n",
    "    'SELECT ?y WITH { SELECT ?y (COUNT(*) AS ?tupcount) WHERE { ?x wdt:P1923 ?y . ?y wdt:P31 wd:Q1194951 . ?x wdt:P31 wd:Q13406554 .  } GROUP BY ?y }  AS %tupcounts1  WITH { SELECT DISTINCT ?y (0 AS ?tupcount) WHERE { { { ?b wdt:P1923 ?y . ?y wdt:P31 wd:Q1194951 .  } } FILTER NOT EXISTS { ?x wdt:P1923 ?y . ?y wdt:P31 wd:Q1194951 . ?x wdt:P31 wd:Q13406554 .  } } } AS %zerotupcounts1  WITH { SELECT ?y (COUNT(*) AS ?tupcount) WHERE { ?x wdt:P1923 ?y . ?y wdt:P31 wd:Q1194951 . ?x wdt:P31 wd:Q15275719 .  } GROUP BY ?y }  AS %tupcounts2 WITH { SELECT DISTINCT ?y (0 AS ?tupcount) WHERE { { { ?b wdt:P1923 ?y . ?y wdt:P31 wd:Q1194951 .  } }  FILTER NOT EXISTS { ?x wdt:P1923 ?y . ?y wdt:P31 wd:Q1194951 . ?x wdt:P31 wd:Q15275719 .  } } } AS %zerotupcounts2  WITH {  SELECT ?y (SUM(?tupcount) AS ?tupcountfin) WHERE { { SELECT ?y ?tupcount WHERE { INCLUDE %tupcounts1 } } UNION { SELECT ?y ?tupcount WHERE { INCLUDE %zerotupcounts1 } } UNION { SELECT ?y ?tupcount WHERE { INCLUDE %tupcounts2 } } UNION { SELECT ?y ?tupcount WHERE { INCLUDE %zerotupcounts2 } }  } GROUP BY ?y } AS %TuplesCounts  WITH { SELECT (MIN(?tupcountfin) AS ?count) WHERE { INCLUDE %TuplesCounts } } AS %maxMinCount  WHERE { INCLUDE %TuplesCounts . INCLUDE %maxMinCount .  FILTER (?tupcountfin = ?count) }'\n",
    "]\n",
    "\n",
    "for query in queries:\n",
    "    print(parser.parse_query(query))\n",
    "    print()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 54,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "1 1149\n"
     ]
    },
    {
     "data": {
      "text/plain": [
       "['SELECT ?x WHERE { ?x wdt:P710 wd:Q526275 . ?x wdt:P31 wd:Q1203472 .  FILTER NOT EXISTS { ?x wdt:P710 wd:Q1736517 .  } }']"
      ]
     },
     "execution_count": 54,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "import json\n",
    "data = json.load(open('data/processed_spice_data/train.json', 'r'), strict=False)\n",
    "hit = 0\n",
    "complex_data = []\n",
    "for example in data:\n",
    "    query = example['sparql_query']\n",
    "    try:\n",
    "        expr = parser.parse_query(query)\n",
    "    except:\n",
    "        example['s_expression'] = expr\n",
    "        complex_data.append(example)\n",
    "print(len(complex_data), len(data))\n",
    "[example['sparql_query'] for example in complex_data]\n",
    "# json.dump(simple_data, open('data/processed_spice_data/dev_simple.json', 'w'), indent=4)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 5,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "'\\nSELECT ?x \\nWITH {\\n    SELECT ?x (COUNT(*) AS ?tupcount)\\n    WHERE {\\n        ?x start_point ?y .\\n        ?x P31 type_of_sport .\\n        ?y P31 type_of_french_administrative_division .\\n    }\\n    GROUP BY ?x \\n}  AS %tupcounts1\\nWITH {\\n    SELECT DISTINCT ?x (0 AS ?tupcount)\\n    WHERE {\\n        { {\\n        ?x start_point ?b .\\n        ?x P31 type_of_sport .\\n        } } \\n        FILTER NOT EXISTS {\\n            ?x start_point ?y .\\n            ?x P31 type_of_sport .\\n            ?y P31 type_of_french_administrative_division .\\n        }\\n    } \\n} AS %zerotupcounts1\\nWITH {\\n    SELECT ?x (COUNT(*) AS ?tupcount)\\n    WHERE {\\n        ?x start_point ?y .\\n        ?x P31 type_of_sport .\\n        ?y P31 administrative_territorial_entity .\\n    }\\n    GROUP BY ?x \\n}  AS %tupcounts2\\nWITH {\\n    SELECT DISTINCT ?x (0 AS ?tupcount)\\n    WHERE { \\n        { { \\n        ?x start_point ?b .\\n        ?x P31 type_of_sport .\\n        } } \\n        FILTER NOT EXISTS {\\n            ?x start_point ?y .\\n            ?x P31 type_of_sport .\\n            ?y P31 administrative_territorial_entity .\\n        }\\n    }\\n} AS %zerotupcounts2\\nWITH {\\n    SELECT ?x (SUM(?tupcount) AS ?tupcountfin)\\n    WHERE { \\n        {\\n            SELECT ?x ?tupcount\\n            WHERE { INCLUDE %tupcounts1 }\\n        } UNION { \\n            SELECT ?x ?tupcount\\n            WHERE { INCLUDE %zerotupcounts1 }\\n        } UNION { \\n            SELECT ?x ?tupcount\\n            WHERE { INCLUDE %tupcounts2 } \\n        } UNION {\\n            SELECT ?x ?tupcount\\n            WHERE { INCLUDE %zerotupcounts2 }\\n        }\\n    }\\n    GROUP BY ?x\\n} AS %TuplesCounts\\nWHERE {INCLUDE %TuplesCounts. FILTER (?tupcountfin > 0) }\\n'"
      ]
     },
     "execution_count": 5,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "\"Which types of sport have start point at around 1 french administrative divisions or administrative territories ? [CTX]\"\n",
    "\n",
    "\"\"\"\n",
    "SELECT ?x \n",
    "WITH {\n",
    "    SELECT ?x (COUNT(*) AS ?tupcount)\n",
    "    WHERE {\n",
    "        ?x start_point ?y .\n",
    "        ?x P31 type_of_sport .\n",
    "        ?y P31 type_of_french_administrative_division .\n",
    "    }\n",
    "    GROUP BY ?x \n",
    "}  AS %tupcounts1\n",
    "WITH {\n",
    "    SELECT DISTINCT ?x (0 AS ?tupcount)\n",
    "    WHERE {\n",
    "        { {\n",
    "        ?x start_point ?b .\n",
    "        ?x P31 type_of_sport .\n",
    "        } } \n",
    "        FILTER NOT EXISTS {\n",
    "            ?x start_point ?y .\n",
    "            ?x P31 type_of_sport .\n",
    "            ?y P31 type_of_french_administrative_division .\n",
    "        }\n",
    "    } \n",
    "} AS %zerotupcounts1\n",
    "WITH {\n",
    "    SELECT ?x (COUNT(*) AS ?tupcount)\n",
    "    WHERE {\n",
    "        ?x start_point ?y .\n",
    "        ?x P31 type_of_sport .\n",
    "        ?y P31 administrative_territorial_entity .\n",
    "    }\n",
    "    GROUP BY ?x \n",
    "}  AS %tupcounts2\n",
    "WITH {\n",
    "    SELECT DISTINCT ?x (0 AS ?tupcount)\n",
    "    WHERE { \n",
    "        { { \n",
    "        ?x start_point ?b .\n",
    "        ?x P31 type_of_sport .\n",
    "        } } \n",
    "        FILTER NOT EXISTS {\n",
    "            ?x start_point ?y .\n",
    "            ?x P31 type_of_sport .\n",
    "            ?y P31 administrative_territorial_entity .\n",
    "        }\n",
    "    }\n",
    "} AS %zerotupcounts2\n",
    "WITH {\n",
    "    SELECT ?x (SUM(?tupcount) AS ?tupcountfin)\n",
    "    WHERE { \n",
    "        {\n",
    "            SELECT ?x ?tupcount\n",
    "            WHERE { INCLUDE %tupcounts1 }\n",
    "        } UNION { \n",
    "            SELECT ?x ?tupcount\n",
    "            WHERE { INCLUDE %zerotupcounts1 }\n",
    "        } UNION { \n",
    "            SELECT ?x ?tupcount\n",
    "            WHERE { INCLUDE %tupcounts2 } \n",
    "        } UNION {\n",
    "            SELECT ?x ?tupcount\n",
    "            WHERE { INCLUDE %zerotupcounts2 }\n",
    "        }\n",
    "    }\n",
    "    GROUP BY ?x\n",
    "} AS %TuplesCounts\n",
    "WHERE {INCLUDE %TuplesCounts. FILTER (?tupcountfin > 0) }\n",
    "\"\"\""
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": []
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "kb-binder",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.12.9"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 2
}
